app/controllers/restaurants_controller.rb

SELECT * FROM "restaurants" ORDER BY name LIMIT 9 OFFSET 0
SELECT * FROM "slugs" WHERE ("slugs".sluggable_id = 3 AND "slugs".sluggable_type = 'Article') ORDER BY id DESC LIMIT 1
SELECT count(*) AS count_all FROM "restaurants"
---
  def index
    #@restaurants = Restaurant.all
    @restaurants = Restaurant.paginate :page => params[:page], :order => 'name', :include => [:slugs]

UPDATE "restaurants" SET "updated_at" = '2010-09-30 05:42:31', "photo_file_name" = 'autoscale-original.jpg', "photo_file_size" = 170269, "photo_updated_at" = '2010-09-30 05:42:29' WHERE "id" = 2422
---
  def update
    @restaurant = Restaurant.find(params[:id],:readonly => false)
    if @restaurant.update_attributes(params[:restaurant])

SELECT "restaurants".* FROM "restaurants" JOIN taggings restaurants_taggings_EasternEuropean_995 ON restaurants_taggings_EasternEuropean_995.taggable_id = restaurants.id AND restaurants_taggings_EasternEuropean_995.taggable_type = 'Restaurant' AND restaurants_taggings_EasternEuropean_995.tag_id = 1677 LIMIT 20 OFFSET 0
SELECT tags.*, COUNT(*) AS count FROM "tags" LEFT OUTER JOIN taggings ON tags.id = taggings.tag_id AND taggings.context = 'feature' INNER JOIN restaurants ON restaurants.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Restaurant') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0 ORDER BY name
---
  def tag

    @restaurants = Restaurant.tagged_with(params[:id]).paginate(:page => params[:page], :per_page => 20)